reflections = {
  "हूँ"   : "हो",
  "था"  : "थे",
  "मैं"    : "आप",
  "मेरे पास"  : "आपके पास",
  "मेरा"  : "आपका",
  "हो"  : "हूँ",
  "आपके पास": "मेरे पास",
  "आपका"  : "मेरा",
  "आप"  : "मैं",
  "मुझे"  : "आपको"
}

patterns = [
  [r'मुझे (.*) चाहिए',
  [ "आपको %1 क्यों चाहिए ?",
    "क्या आपको %1 से मदद मिलेगी??",
    "क्या आपको यकीन है आपको %1 चाहिए??"]],

  [r'मैं (.*) हूँ',
  [  "क्या आप मेरे पास आये क्यूंकि आप %1 हो??",
    "आप कितने टाइम से %1 हो??",
    "आप को कैसा लगता है की आप %1 हो??"]],

  [r'क्या आप ([^\?]*) हो\??',
  [  "क्या फरक पड़ता है की मैं %1 हूँ?",
    "क्या आपको बेहतर लगेगा की मैं %1 ना हूँ?",
    "मशायद आपको लगता है मैं %1 हूँ।",
    "मैं शायद %1 हूँ। आपको क्या लगता है?"]],

  [r'क्यूंकि (.*)',
  [  "क्या यह असली कारन है %1?",
    "और क्या कारन आते है आपके दिमाग में?",
    "क्या यह किसी और पे भी लागू होता है?",
    "अगर %1, तो और क्या सच है?"]],

  [r'आपका नाम क्या है?',
  [ "मेरा नाम शिवा हैं। और आपका?",
    "आपको क्या लगता है?"]],
  
  [r'नमस्ते(.*)',
  [  "नमस्ते में खुश हूँ की आप आये।",
    "नमस्ते, आज आप कैसे हो?",
    "आपसे मिलकर खुशी हुई। मैं आपकी कैसे मदद करूँ?",
    "आपका स्वागत हैं!"]],

  [r'(.*) दोस्त (.*)',
  [  "मुझे अपने दोस्तों के बारे में और बताइये",
    "आपके सबसे अच्छे बचपन के दोस्त के बारे में बताइये"]],

  [r'हाँ',
  [  "आप काफी विशवास से बोल रहे हो।",
    "ठीक है। पर इस बारे में क्या आप और बता सकते है?"]],

  [r'मेरा|मेरी (.*)',
  [  "अच्छा, आपका %1.",
    "आप ऐसा क्यों कह रहे की आपका %1?"]],

  [r'आप (.*)',
  [  "हमे आपके बारे में बात करनी है, मेरे नहीं",
    "आप ऐसा मेरे बारे में क्यों बोल रहे हो?",
    "आप अपने बारे में बताइये। आप कहाँ से हैं?"]],

  [r' (.*) क्यों (.*)',
  [  "आपको क्या लगता है क्यों?",
    "यह आप मुझे बताइये?" ]],

  [r'मुझे (.*) चाहिए',
  [  "आपके लिए %1 का क्या महत्व है??",
    "आपको %1 क्यों चाहिए??",
    "अगर आपको मिलेगा तो आप क्या करोगे?"]],

  [r'(.*) पिताजी|पिता|पापा|बाप(.*)',
  [  "अपने पिताजी के बारे में और बताइये?",
    "आप अपने पिताजी के बारे में क्या सोचते है?",]],

  [r'कल (.*) क्या करोगे?',
  [  "आप ऐसा क्यों पूछ रहे है?",
    "ज्यादा कुछ नहीं। और आप?",
    "इस सवाल का जवाब आप ही क्यों नहीं देते?"]],
    
  [r'(.*)\?',
  [  "आप ऐसा क्यों पूछ रहे है?",
    "शायद जवाब आपके पास ही है?",
    "इस सवाल का जवाब आप ही क्यों नहीं देते?"]],

  [r'अलविदा',
  [  "मुझ से बात करने के लिए शुक्रिया।",
    "अलविदा",
    "बाद में मिलते हूँ! अलविदा!",
    "अलविदा! आपका दिन शुभ हो!"
    "धन्यवाद। आपका १५००० रूपए का बिल है।"]],

  [r'(.*)',
  [  "मुझ इस बारे में और बताइये। ",
    "चलिए हम विषय बदलते है.... आप अपने परिवार के बारे में बताइये।",
    "आप %1 क्यों बोल रहे है?",
    "अच्छा...",
    "बहुत ही रोचक।",
    "%1?",
    "इससे आपको कैसा महसुस हो रहा है?",
    "यह कह कर कैसा महसूस करते हो?",
    "यह अच्छा है।"]],
    
  [r'आपसे (.*) लगा',
  [  "आप ऐसा क्यों कह रहे है?",
     "मुझे भी।",
     "मुझे भी %1।"]],
    
  [r'आप (.*) बोलते हैं?',
  [  "आप ऐसा क्यों पूछ रहे है?",
     "मै हिंदी और इंग्लिश बोलता हूँ।",
     "आपको क्या लगता है?"]],
    
    
  [r'(.*) पसंद (.*)?',
  [  "मुझ इस बारे में और बताइये। ",
    "चलिए हम विषय बदलते है.... आप क्या करते हो?",
    "%1",
    "शायद। यह कह कर कैसा महसूस कर रहे हो?"]]
    
  ]
